### Import the necessary libraries

In [2]:
import pandas as pd
import sqlalchemy as alch
from getpass import getpass
#your code here

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [11]:
#Your code here
#user 
password = getpass("Introduce tu contraseña del server mysql:")

Introduce tu contraseña del server mysql:········

### Establishes the connection to the database

In [12]:
#Your code here 
#dbName

#connectionData=f"mysql+pymysql://{user}:{password}@localhost/{dbName}"

db_name = "publications"
conec = f"mysql+pymysql://root:{password}@localhost/{db_name}"

### Remember to create the engine

In [13]:
#Your code here
#engine

engine = alch.create_engine(conec)
print("Connected to server!")

Connected to server!

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [14]:
challenge_1 = pd.read_sql_query(
"""
SELECT authors.au_id AS "AUTHOR ID", au_fname AS "FIRST NAME", au_lname AS "LAST NAME", title AS TITLE, pub_name AS "PUBLISHER"
FROM titleauthor
LEFT JOIN authors
ON titleauthor.au_id = authors.au_id
LEFT JOIN titles
ON titleauthor.title_id = titles.title_id
LEFT JOIN publishers
ON titles.pub_id = publishers.pub_id;
""", engine
)

In [22]:
challenge_1.head()

,AUTHOR ID,FIRST NAME,LAST NAME,TITLE,PUBLISHER
0,213-46-8915,Marjorie,Green,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Abraham,Bennet,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,Michael,O'Leary,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,Stearns,MacFeather,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Marjorie,Green,You Can Combat Computer Stress!,New Moon Books

In [23]:
challenge_1.count()

AUTHOR ID     25
FIRST NAME    25
LAST NAME     25
TITLE         25
PUBLISHER     25
dtype: int64

In [17]:
verification_1 = pd.read_sql_query(
"""
SELECT COUNT(au_id)
FROM titleauthor;
""", engine
)

In [19]:
verification_1

   COUNT(au_id)
0            25

#### Both queries should have the same amount of rows if the challenge is OK.

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [24]:
challenge_2 = pd.read_sql_query("""
SELECT authors.au_id AS "AUTHOR ID", au_fname AS "FIRST NAME", au_lname AS "LAST NAME", pub_name AS "PUBLISHER", COUNT(title) AS "TITLE COUNT"
FROM titleauthor
LEFT JOIN authors
ON titleauthor.au_id = authors.au_id
LEFT JOIN titles
ON titleauthor.title_id = titles.title_id
LEFT JOIN publishers
ON titles.pub_id = publishers.pub_id
GROUP BY authors.au_id, publisher
ORDER BY authors.au_id DESC;
""", engine
)

In [27]:
challenge_2.head()

     AUTHOR ID FIRST NAME LAST NAME             PUBLISHER  TITLE COUNT
0  998-72-3567     Albert    Ringer        New Moon Books            2
1  899-46-2035       Anne    Ringer      Binnet & Hardley            1
2  899-46-2035       Anne    Ringer        New Moon Books            1
3  846-92-7186     Sheryl    Hunter  Algodata Infosystems            1
4  807-91-6654     Sylvia  Panteley      Binnet & Hardley            1

In [30]:
challenge_2["TITLE COUNT"].sum()

25

#### We verified that this one it's correct too.

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [41]:
challenge_3 = pd.read_sql_query("""
SELECT authors.au_id AS "AUTHOR ID", au_fname AS "FIRST NAME", au_lname AS "LAST NAME", SUM(qty) AS "TOTAL"
FROM titleauthor
LEFT JOIN authors
ON titleauthor.au_id = authors.au_id
LEFT JOIN sales
ON titleauthor.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY SUM(qty) DESC
LIMIT 3;
""", engine
)

In [42]:
challenge_3

     AUTHOR ID FIRST NAME LAST NAME  TOTAL
0  899-46-2035       Anne    Ringer  148.0
1  998-72-3567     Albert    Ringer  133.0
2  427-17-2319        Ann      Dull   50.0

#### We need to have in mind that a book can have a many authors so the sum of the total sales of each authors won't be the same that the sum of total sales.

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [48]:
challenge_4 = pd.read_sql_query("""
SELECT authors.au_id AS "AUTHOR ID", au_fname AS "FIRST NAME", au_lname AS "LAST NAME",  IFNULL(SUM(qty), 0) AS "TOTAL"
FROM titleauthor
RIGHT JOIN authors
ON titleauthor.au_id = authors.au_id
LEFT JOIN sales
ON titleauthor.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY SUM(qty) DESC;
""", engine
)

In [49]:
challenge_4

      AUTHOR ID   FIRST NAME       LAST NAME  TOTAL
0   899-46-2035         Anne          Ringer  148.0
1   998-72-3567       Albert          Ringer  133.0
2   213-46-8915     Marjorie           Green   50.0
3   846-92-7186       Sheryl          Hunter   50.0
4   427-17-2319          Ann            Dull   50.0
5   267-41-2394      Michael         O'Leary   45.0
6   724-80-9391      Stearns      MacFeather   45.0
7   807-91-6654       Sylvia        Panteley   40.0
8   722-51-5454       Michel        DeFrance   40.0
9   238-95-7766       Cheryl          Carson   30.0
10  486-29-1786     Charlene        Locksley   25.0
11  472-27-2349         Burt      Gringlesby   20.0
12  648-92-1872     Reginald  Blotchet-Halls   20.0
13  672-71-3249        Akiko        Yokomoto   20.0
14  756-30-7391        Livia          Karsen   20.0
15  172-32-1176      Johnson           White   15.0
16  274-80-9391         Dean        Straight   15.0
17  409-56-7008      Abraham          Bennet   15.0
18  712-45-1867        Innes    del Castillo   10.0
19  724-08-9931         Dirk        Stringer    0.0
20  527-72-3246  Morningstar          Greene    0.0
21  893-72-1158      Heather        McBadden    0.0
22  341-22-1782      Meander           Smith    0.0

## Bonus Challenge - Most Profiting Authors

In [54]:
bonus = pd.read_sql_query("""
SELECT authors.au_id AS "AUTHOR ID", au_lname "LAST NAME", au_fname AS "FIRST NAME",SUM(advance * (royaltyper/100) + qty * price * (royaltyper/100) * (royalty/100)) AS PROFIT
FROM authors
LEFT JOIN titleauthor
ON authors.au_id = titleauthor.au_id
LEFT JOIN titles
ON titleauthor.title_id = titles.title_id
LEFT JOIN sales
ON titles.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY PROFIT DESC
LIMIT 3;
""", engine
)

In [55]:
bonus

     AUTHOR ID LAST NAME FIRST NAME     PROFIT
0  722-51-5454  DeFrance     Michel  22521.528
1  213-46-8915     Green   Marjorie  14162.110
2  899-46-2035    Ringer       Anne  12128.132